Repository: Druki-ru/website
Catalog: translations/*.po
Languages: ru

source: Promo
ru: Промо

source: Promo image
ru: Промо-изображение

source: Media entity that contains a promo image.
ru: Медиа-сущность, которая содержит промо-изображение.

source: Promo image style
ru: Стиль промо-изображения

source: Why Drupal
ru: Почему Drupal

source: Media entity that contains a remote video.
ru: Медиа сущность которая содержит внешнее видео.

source: Druki Settings
ru: Настройки Druki

source: Frontpage settings
ru: Настройки главной страницы

source: Frontpage
ru: Главная страница

# short
source: Frontpage
ru: Главная

source: Settings for frontpage.
ru: Настройки для главной страницы.

source: General settings
ru: Общие настройки

source: Wiki
ru: Энциклопедия

source: Drupal event
ru: Drupal мероприятие

source: Event image
ru: Изображение мероприятия

source: Media entity that contains an event promo image
ru: Медиа-сущность, которая содержит промо-изображение для мероприятия

source: Official user guide settings
ru: Настройки официального руководства пользователя

source: Official user guide
ru: Официальное руководство пользователя

source: Settings for displaying the official user guide.
ru: Настройки отображения официального руководства пользователя.

# edit content
source: Edit
ru: Редактировать

source: Drupal is a registered trademark of <a href="@url">@name</a>.
ru: Drupal — зарегистрированная торговая марка <a href="@url">@name</a>.

source: <a href="@source_url">The source code</a> of the site is provided under the <a href="@license_url">@license_name</a>.
ru: <a href="@source_url">Исходный код</a> сайта предоставляется по лицензии <a href="@license_url">@license_name</a>.

source: <a href="@source_url">The content</a> of the site is provided under the <a href="@license_url">@license_name</a>.
ru: <a href="@source_url">Содержимое</a> сайта предоставляется по лицензии <a href="@license_url">@license_name</a>.

source: Developed by <a href="@url">@name</a> with love on Drupal.
ru: Разработано <a href="@url">@name</a> с любовью на Drupal.

source: Read more
ru: Подробнее

source: A structured, free, and open source information about Drupal.
ru: Структурированный, свободный и открытый источник информации о Drupal.

source: Drupal Encyclopedia
ru: Drupal Энциклопедия

source: Site search
ru: Поиск по сайту

source: What do you want to know today?
ru: Что вы хотите узнать сегодня?

source: Search
ru: Поиск

source: Go to encyclopedia
ru: Перейти в энциклопедию

source: What Drupal is?
ru: Что такое Drupal?

source: Drupal is the leading OpenSource platform that knows that your web content should cover more than just websites.
ru: Drupal — это лидирующая OpenSource платформа, которая знает, что ваш веб-контент должен охватывать не только веб-сайты.

source: Drupal is built in such a way that you can deliver the right content to the right person, at the right time - on any device.
ru: Drupal построен таким образом, что вы можете доставлять необходимый контент, нужному человеку, в нужное время - на любом устройстве.

source: Actual minor release
ru: Актуальный минорный релиз

source: from
ru: от

source: Actual patch release
ru: Актуальный патч релиз

source: Next minor release
ru: Следующий минорный релиз

source: Full list of releases
ru: Полный список релизов

source: The best way to try Drupal is to download it.
ru: Лучший способ попробовать Drupal — загрузить его.

source: Choose Drupal
ru: Выбирайте Drupal

source: If you are just getting started with web development, Drupal will provide you with invaluable experience in various areas and technologies. You will always have something to learn and develop your professional skills.
ru: Если вы только начинаете своё знакомство с веб-разработкой, Drupal предоставит вам бесценный опыт в различных направлениях и технологиях. Вам всегда будет чему научиться и развить свои профессиональные навыки.

source: For an experienced developer - Drupal will open new horizons, tools, approaches and implementations. Drupal means strict code standards, tens of thousands of tests, incredible flexibility and scalability for any needs.
ru: Для опытного разработчика — Drupal откроет новые горизонты, инструменты, подходы и реализации. Drupal — это строгие стандарты кода, десятки тысяч тестов, невероятная гибкость и масштабируемость под любые нужды.

source: We all have different needs - Drupal allows us to create a unique space in the world of template solutions.
ru: У всех нас разные потребности — Drupal позволяет создать уникальное пространство в мире шаблонных решений.

source: encyclopedia
ru: энциклопедия

source: Help & Feedback
ru: Помощь и обратная связь

source: Edit this page
ru: Редактировать эту страницу

source: If you <strong>spot an error or a need for improvement</strong> and would like to <strong>fix it yourself</strong> in a Pull Request
ru: Если вы <strong>обнаружили ошибку или хотите внести улучшения</strong>, и желаете <strong>внести изменения самостоятельно</strong> при помощи Pull Request

source: If you would like to <strong>suggest an improvement to this doc</strong>
ru: Если вы желаете <strong>предложить улучшение для этого документа</strong>

source: Feedback: @title
ru: Обратная связь: @title

source: Create an issue
ru: Создать обращение

source: Describe what is wrong.
ru: Опишите, что не так.

source: Get Help
ru: Обратиться за помощью

source: Send email
ru: Отправить email

source: If you didn't find what you were looking for, <a href="@search_url">search the docs</a>.
ru: Если вы не нашли то что искали, <a href="@search_url">воспользуйтесь поиском</a>.

source: If you want help with something specific, <a href="@community_resources_url">contact the community</a>.
ru: Если вам нужна помощь с чем-то конкретным, <a href="@community_resources_url">обратитесь к сообществу</a>.

source: Anchor link
ru: Ссылка-якорь

source: Download Drupal
ru: Загрузить Drupal

source: Drupal Wiki
ru: Drupal Энциклопедия

source: Drupal wiki
ru: Drupal энциклопедия

source: Optimized remote video
ru: Оптимизированное внешнее видео

source: Thumbnail style
ru: Стиль уменьшенного изображения

source: Thumbnail style: @style
ru: Стиль уменьшенного изображения: @style

source: Project repository
ru: Репозиторий проекта

source: Get help
ru: Получить помощь

# color scheme
source: Light
ru: Светлая

# color scheme
source: Dark
ru: Тёмная

# color scheme
source: Inherit from the system
ru: Наследовать из системы

# content
source: Previous
ru: Предыдущий

# content
source: Next
ru: Следующий

source: Help us to improve these docs!
ru: Помогите нам сделать документацию лучше!

source: All Druki docs are open source. See something that's wrong or unclear? Submit a pull request.
ru: Вся документация Druki с отрытым исходным кодом. Нашли ошибку или неточность? Создайте pull request.

source: Edit this doc
ru: Редактировать текущий документ

source: Discuss an improvement
ru: Обсудить улучшение

source: Or, <a href="@url">learn how to contribute</a>.
ru: Или <a href="@url">узнайте как контрибутить</a>.

source: Still need help?
ru: По-прежнему нужна помощь?

source: Ask on GitHub community
ru: Задайте вопрос на GitHub

source: See other community resources
ru: Смотрите другие ресурсы сообщества

source: Settings for elements displayed on frontpage.
ru: Настройки для элементов отображаемых на главной странице.

source: Druki content
ru: Druki содержимое

source: Druki content TOC
ru: Содержание Druki содержимого

source: Internal links
ru: Внутренние ссылки

source: Druki content page
ru: Страница Druki содержимого

source: Computed alias
ru: Вычисленный псевдоним

source: The computed alias depends on meta data.
ru: Вычисляемый всевдоним зависящий от метаданных.

source: Are you sure you want to do this?
ru: Вы уверены что хотите сделать это?

source: Git Information
ru: Информация из Git

source: External ID
ru: Внешний ID

source: Core version
ru: Версия ядра

source: Relative pathname
ru: Относительный путь

source: Last commit ID
ru: ID последнего коммита

source: New druki content %label has been created.
ru: Создано новое Druki содержимое %label.

source: The druki content %label has been updated.
ru: Обновлена метка Druki содержимого %label.

source: Total druki contents: @total
ru: Количество Druki содержимого: @total

source: Internal ID
ru: Внутренний ID

source: Convert internal links by content ID to actual links.
ru: Конвертирует внутренние ссылки по их ID содержимого в реальные ссылки.

source: Delete all druki content
ru: Удалить всё Druki содержимое

source: Settings for Druki content entity.
ru: Настройки для сущности Druki содержимого.

source: Entity settings
ru: Настройки сущности

source: Configure a Druki content entity type.
ru: Конфигурации для сущности Druki содержимого.

source: List of content
ru: Список содержимого

source: List of druki content.
ru: Список Druki содержимого.

source: Contents
ru: Содержание

source: Difficulty
ru: Сложность

source: Update queue
ru: Очередь обновлений

source: Current queue items: @count
ru: Текущее количество элементов очереди: @count

source: Force content processing
ru: Принудительная обработка содержимого

source: Content will be processed even if it not updated from last queue.
ru: Содержимое будет обработано даже в том случае, если оно не изменилось с момента прошлой очереди.

source: Run queue
ru: Запустить очередь

source: Clear queue
ru: Очистить очередь

source: Druki content sync.
ru: Синхронизация Druki содержимого.

source: The required dependency @dependency is missing. Install it and try again.
ru: Обязательная зависимость @dependency не найдена. Установите её и попробуйте снова.

source: Druki category
ru: Druki категория

source: Category navigation
ru: Навигация по категории

source: Content sync
ru: Синхронизация содержимого

source: Manage queue
ru: Управление очередью

source: Queue builder
ru: Построитель очереди

source: Build from Git
ru: Собрать из Git

source: Pull from Git
ru: Запросить из Git

source: The "git pull" command will be invoked, which will trigger event and build queue from it.
ru: Будет выполнена команда "git pull", которая вызовет событие, которое, в свою очередь, соберёт очередь.

source: Build from folder
ru: Собрать из директории

source: The URI with source content.
ru: URI до директории с исходным содержимым.

source: You're reading the content for <strong>Drupal @core</strong>.
ru: Вы читаете материал для <strong>Drupal @core</strong>.

source: The content is also available for other versions: @links.
ru: Материал также доступен для следующих версий: @links.

source: Git repository not found in provided path. Please, make sure you have actual repository in the path, or path is correct.
ru: Git репозиторий не найден по указанному пути. Пожалуйста, убедитесь что репозиторий действительно существует по указанному пути, или путь указан верно.

source: Git status
ru: Git статус

source: Pull from remote repository
ru: Получить из удаленного репозитория

source: The Webhook URL which can be used to trigger pull events and all consecutive operations.
ru: URL Webhook, который может быть использован для вызова событий получения данных и всех последующих операций.

source: Regenerate key
ru: Перегенерировать ключ

source: Repository path
ru: Путь до репозитория

source: The local path to repository cloning.
ru: Локальный путь для клонирования репозитория.

source: <strong>Last commit ID:</strong> @value
ru: <strong>ID последнего коммита:</strong> @value

source: Git pull executed successfully.
ru: Git pull вызван успешно.

source: Git pull end up with error.
ru: Git pull завершился с ошибкой.

source: Druki Git Settings
ru: Настройки Druki Git

source: Git settings
ru: Настройки Git

source: Settings and status
ru: Настройки и статус

source: Status about last commit, git pull, settings for webhook URL and repository path.
ru: Статус о последнем коммите, git pull, настройки для URL вебхука и путь до репозитория.

source: Repository settings
ru: Настройки репозитория

source: Repository URL
ru: URL репозитория

source: The remote repository URL.
ru: URL до удаленного репозитория.

source: Global search
ru: Глобальный поиск

source: Druki content core
ru: Ядро Druki содержимого

source: Processed core value.
ru: Обработанное значение ядра.

source: Druki content difficulty
ru: Сложность Druki содержимого

source: Processed difficulty value.
ru: Обработанное значение сложности.

source: What are we searching for today?
ru: Что поищем сегодня?

source: Apply filters
ru: Применить фильтры

source: Not applicable
ru: Не применимо

source: Nothing was found.
ru: Ничего не найдено.

source: Search results for "%keys"
ru: Результаты поиска для "%keys"

source: No results found for "%keys"
ru: Результаты по запросу "%keys" не найдены

source: No results found.
ru: Ничего не найдено.

source: You didn't enter a search query.
ru: Вы не указали поисковый запрос.

source: Can't find an answer to your question? Ask the community for help!
ru: Не нашли ответа на свой вопрос? Попросите помощи у сообщества!
